import java.util.*;


public class Main {
    public static  void main(String[] args) {

        String[] масивПрізвищ=  { "Антоно","Шевченко","Бойко","Шевченко", "Кравченко", "Савицький", "Антонов", "Шевченко", "Тетерів", "Мамченко"};

        List<String> списокПрізвищ= new ArrayList<>();
        for (String прізвища : масивПрізвищ){
            списокПрізвищ.add(прізвища);
            System.out.println(прізвища);
        }


        Set<String> набірПрізвищ=new TreeSet<>();
     набірПрізвищ.add(масивПрізвищ[0]);
        набірПрізвищ.add(масивПрізвищ[1]);
        набірПрізвищ.add(масивПрізвищ[2]);
        набірПрізвищ.add(масивПрізвищ[3]);
        набірПрізвищ.add(масивПрізвищ[4]);
        набірПрізвищ.add(масивПрізвищ[5]);
        набірПрізвищ.add(масивПрізвищ[6]);
        набірПрізвищ.add(масивПрізвищ[7]);
        набірПрізвищ.add(масивПрізвищ[8]);
        набірПрізвищ.add(масивПрізвищ[9]);
        System.out.println(набірПрізвищ);



        Map<String, Integer> кількістьЛітер = new TreeMap();
        for (String прізвища: масивПрізвищ) {
            кількістьЛітер.put((прізвища),(прізвища).length());;
        }
        System.out.println(кількістьЛітер);












    }}
