import java.util.*;

public class Main {
    public static void main(String[] args) {

        String[] масивПрізвищ=  { "Антоно","Шевченко","Бойко","Шевченко", "Кравченко", "Савицький", "Антонов", "Шевченко", "Тетерів", "Мамченко"};
        List<String> списокПрізвищ= new ArrayList<>();
        for (String прізвища : масивПрізвищ){
            списокПрізвищ.add(прізвища);
            System.out.println(прізвища);
        }
        Set<String> набірПрізвищ=new TreeSet<>();
     набірПрізвищ.add(масивПрізвищ[0]);
        набірПрізвищ.add(масивПрізвищ[1]);
        набірПрізвищ.add(масивПрізвищ[2]);
        набірПрізвищ.add(масивПрізвищ[3]);
        набірПрізвищ.add(масивПрізвищ[4]);
        набірПрізвищ.add(масивПрізвищ[5]);
        набірПрізвищ.add(масивПрізвищ[6]);
        набірПрізвищ.add(масивПрізвищ[7]);
        набірПрізвищ.add(масивПрізвищ[8]);
        набірПрізвищ.add(масивПрізвищ[9]);
        System.out.println(набірПрізвищ);



        Map<String, Integer> кількістьЛітер = new TreeMap();

        кількістьЛітер.put((масивПрізвищ[0]),(масивПрізвищ[0]).length());
        кількістьЛітер.put((масивПрізвищ[1]),(масивПрізвищ[1]).length());
        кількістьЛітер.put((масивПрізвищ[2]),(масивПрізвищ[2]).length());
        кількістьЛітер.put((масивПрізвищ[3]),(масивПрізвищ[3]).length());
        кількістьЛітер.put((масивПрізвищ[4]),(масивПрізвищ[4]).length());
        кількістьЛітер.put((масивПрізвищ[5]),(масивПрізвищ[5]).length());
        кількістьЛітер.put((масивПрізвищ[6]),(масивПрізвищ[6]).length());
        кількістьЛітер.put(масивПрізвищ[7],(масивПрізвищ[7]).length());
        кількістьЛітер.put(масивПрізвищ[8],(масивПрізвищ[8]).length());
        кількістьЛітер.put((масивПрізвищ[9]),(масивПрізвищ[9]).length());
        Integer букви1 = кількістьЛітер.get(масивПрізвищ[1]);
        Integer букви2 = кількістьЛітер.get(масивПрізвищ[2]);

        System.out.println(букви1);
        System.out.println(букви2);
        System.out.println(кількістьЛітер);










    }}
