import java.util.*;

public class Main {
    public static void main(String[] args) {

        String[] масивПрізвищ=  { "Антоно","Шевченко","Бойко","Шевченко", "Кравченко", "Савицький", "Антонов", "Шевченко", "Тетерів", "Мамченко"};
        List<String> списокПрізвищ= new ArrayList<>();
        for (String прізвища : масивПрізвищ){
            списокПрізвищ.add(прізвища);
            System.out.println(прізвища);
        }
        Set<String> набірПрізвищ=new TreeSet<>();
     набірПрізвищ.add(масивПрізвищ[0]);
        набірПрізвищ.add(масивПрізвищ[1]);
        набірПрізвищ.add(масивПрізвищ[2]);
        набірПрізвищ.add(масивПрізвищ[3]);
        набірПрізвищ.add(масивПрізвищ[4]);
        набірПрізвищ.add(масивПрізвищ[5]);
        набірПрізвищ.add(масивПрізвищ[6]);
        набірПрізвищ.add(масивПрізвищ[7]);
        набірПрізвищ.add(масивПрізвищ[8]);
        набірПрізвищ.add(масивПрізвищ[9]);
        System.out.println(набірПрізвищ);



        Map<String, Integer> кількістьЛітер = new TreeMap();

        кількістьЛітер.put((масивПрізвищ[0]),6);
        кількістьЛітер.put((масивПрізвищ[1]),8);
        кількістьЛітер.put((масивПрізвищ[2]),5);
        кількістьЛітер.put((масивПрізвищ[3]),8);
        кількістьЛітер.put((масивПрізвищ[4]),9);
        кількістьЛітер.put((масивПрізвищ[5]),9);
        кількістьЛітер.put((масивПрізвищ[6]),7);
        кількістьЛітер.put(масивПрізвищ[7],8);
        кількістьЛітер.put(масивПрізвищ[8],7);
        кількістьЛітер.put((масивПрізвищ[9]),8);
        Integer буквиШевченко = кількістьЛітер.get("Шевченко");
        System.out.println(буквиШевченко);
        System.out.println(кількістьЛітер);










    }}
