import java.util.*;

public class Main {
    public static void main(String[] args) {
      String[] масивПрізвищ=  { "Антоно","Шевченко","Бойко","Шевченко", "Кравченко", "Савицький", "Антонов", "Шевченко", "Тетерів", "Мамченко"};
        List<String> списокПрізвищ= new ArrayList<>();
        for (String прізвища : масивПрізвищ){
            списокПрізвищ.add(прізвища);
            System.out.println(прізвища);
        }
        Set<String> набірПрізвищ=new TreeSet<>();
       набірПрізвищ.add("Антоно");
        набірПрізвищ.add("Шевченко");
        набірПрізвищ.add("Бойко");
        набірПрізвищ.add("Шевченко");
        набірПрізвищ.add("Кравченко");
        набірПрізвищ.add("Савицький");
        набірПрізвищ.add("Антонов");
        набірПрізвищ.add("Шевченко");
        набірПрізвищ.add("Тетерів");
        набірПрізвищ.add("Мамченко");
        System.out.println(набірПрізвищ);

Map<String,Float> кількістьЛітер = new HashMap<>();
кількістьЛітер.put("Антоно",6F);
        кількістьЛітер.put("Шевченко",7F);
        кількістьЛітер.put("Бойко",5F);
        кількістьЛітер.put("Кравченко",9F);
        кількістьЛітер.put("Савицький",9F);
        кількістьЛітер.put("Антонов",7F);
         Float буквиШевченко = кількістьЛітер.get("Шевченко");
        Float буквиАнтонов = кількістьЛітер.get("Антонов");
        Float буквиСавицький = кількістьЛітер.get("Савицький");
        System.out.println(буквиШевченко);
        System.out.println(буквиАнтонов);
        System.out.println(буквиСавицький);








    }
}